import {useSelector} from "react-redux";
import {useEffect} from "react";
import "./Profile.css";
import MainFooter from "../main/MainFooter";

const Profile = () => {
    let user = useSelector(state => state.user);

    useEffect(() => {
        console.log(user);
    }, [user]);

    return (
        <div className="MyPage">
            <div className="mypageContainer">
                <div className="mypageTextDiv">
                    <div className="mypageContent">
                        <p className="title">My</p>
                    </div>
                    <div className="profileNameDiv">
                        <svg xmlns="http://www.w3.org/2000/svg" width="35" height="35" viewBox="0 0 35 35" fill="none">
                            <g clipPath="url(#clip0_181_1705)">
                                <path
                                    d="M17.5 35C12.8587 35 8.40752 33.1563 5.12563 29.8744C1.84374 26.5925 0 22.1413 0 17.5C0 12.8587 1.84374 8.40752 5.12563 5.12563C8.40752 1.84374 12.8587 0 17.5 0C22.1413 0 26.5925 1.84374 29.8744 5.12563C33.1563 8.40752 35 12.8587 35 17.5C35 22.1413 33.1563 26.5925 29.8744 29.8744C26.5925 33.1563 22.1413 35 17.5 35ZM19.3528 17.1828C20.5652 16.7466 21.5849 15.8967 22.2322 14.7826C22.8796 13.6685 23.1131 12.3618 22.8917 11.0925C22.6703 9.82312 22.0082 8.6726 21.0219 7.84345C20.0357 7.01431 18.7885 6.55972 17.5 6.55972C16.2115 6.55972 14.9643 7.01431 13.9781 7.84345C12.9918 8.6726 12.3297 9.82312 12.1083 11.0925C11.8869 12.3618 12.1204 13.6685 12.7678 14.7826C13.4151 15.8967 14.4348 16.7466 15.6472 17.1828C11.9678 18.0709 8.75 21.3828 8.75 24.0625C8.75 24.9266 9.06719 26.2391 10.9375 26.2391H24.0625C25.9328 26.2391 26.25 24.9266 26.25 24.0625C26.25 21.385 23.0344 18.0687 19.3528 17.1828Z"
                                    fill="#E3E3EF"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_181_1705">
                                    <rect width="35" height="35" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                        <div className="textWrapper">
                            <p className="mypageNameText">이연지</p>
                            <p className="kakaoIdText">카톡ID</p>
                        </div>
                    </div>


                    <div className="profileContainerDiv">
                        <div className="profileContainer">
                            <p className="profileText">01년생, 여자, 경주, ESFP</p>
                            <div className="createDate">
                                <svg className="calendarIcon" xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20"
                                     fill="none">
                                    <path
                                        d="M10.5627 2.16683H8.93766V1.35433C8.93766 1.2825 8.90913 1.21361 8.85834 1.16282C8.80755 1.11203 8.73866 1.0835 8.66683 1.0835C8.595 1.0835 8.52611 1.11203 8.47532 1.16282C8.42453 1.21361 8.396 1.2825 8.396 1.35433V2.16683H4.60433V1.35433C4.60433 1.2825 4.5758 1.21361 4.525 1.16282C4.47421 1.11203 4.40533 1.0835 4.3335 1.0835C4.26167 1.0835 4.19278 1.11203 4.14199 1.16282C4.0912 1.21361 4.06266 1.2825 4.06266 1.35433V2.16683H2.43766C2.07865 2.16726 1.73446 2.31007 1.4806 2.56393C1.22673 2.81779 1.08393 3.16198 1.0835 3.521V10.5627C1.08393 10.9217 1.22673 11.2659 1.4806 11.5197C1.73446 11.7736 2.07865 11.9164 2.43766 11.9168H10.5627C10.9217 11.9165 11.266 11.7738 11.5199 11.5199C11.7738 11.266 11.9165 10.9217 11.9168 10.5627V3.521C11.9165 3.16194 11.7738 2.81767 11.5199 2.56377C11.266 2.30988 10.9217 2.16712 10.5627 2.16683ZM11.3752 10.5627C11.3752 10.7782 11.2896 10.9848 11.1372 11.1372C10.9848 11.2896 10.7782 11.3752 10.5627 11.3752H2.43766C2.22217 11.3752 2.01551 11.2896 1.86314 11.1372C1.71077 10.9848 1.62516 10.7782 1.62516 10.5627V5.9585H11.3752V10.5627ZM11.3752 5.41683H1.62516V3.521C1.62516 3.0725 1.98808 2.7085 2.43766 2.7085H4.06266V3.521C4.06266 3.59283 4.0912 3.66171 4.14199 3.7125C4.19278 3.7633 4.26167 3.79183 4.3335 3.79183C4.40533 3.79183 4.47421 3.7633 4.525 3.7125C4.5758 3.66171 4.60433 3.59283 4.60433 3.521V2.7085H8.396V3.521C8.396 3.59283 8.42453 3.66171 8.47532 3.7125C8.52611 3.7633 8.595 3.79183 8.66683 3.79183C8.73866 3.79183 8.80755 3.7633 8.85834 3.7125C8.90913 3.66171 8.93766 3.59283 8.93766 3.521V2.7085H10.5627C10.7782 2.7085 10.9848 2.7941 11.1372 2.94647C11.2896 3.09885 11.3752 3.30551 11.3752 3.521V5.41683Z"
                                        fill="#C7C7C7"/>
                                </svg>
                                <p className="profile">xx년 xx월 xx일</p>
                            </div>
                            <div className="profileGender">
                                <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20"
                                     fill="none">
                                    <path
                                        d="M6.90625 1.625V2.4375H9.97872L7.55341 4.86281C6.90943 4.34476 6.10773 4.06239 5.28125 4.0625C3.26625 4.0625 1.625 5.70375 1.625 7.71875C1.625 9.73375 3.26625 11.375 5.28125 11.375C7.29625 11.375 8.9375 9.73375 8.9375 7.71875C8.93709 6.89223 8.65477 6.09058 8.13719 5.44619L10.5625 3.02087V6.09375H11.375V1.625H6.90625ZM5.28125 4.875C6.85669 4.875 8.125 6.14331 8.125 7.71875C8.125 9.29419 6.85669 10.5625 5.28125 10.5625C3.70581 10.5625 2.4375 9.29419 2.4375 7.71875C2.4375 6.14331 3.70581 4.875 5.28125 4.875Z"
                                        fill="#C7C7C7"/>
                                </svg>
                                <p className="profile">성별</p>
                            </div>
                        </div>
                    </div>


                    <p className="introduce">자기소개 전체 보기></p>
                </div>
            </div>
            <div className="managementContainer">
                <div className="managementList">
                    <div className="managementText">
                        <p className="smallText">내 관리</p>
                        <p className="listText">내 정보 수정</p>
                        <p className="listText">친구 정보 수정</p>
                        <p className="listText">룸메이트 정보 수정</p>
                        <p className="listText">매칭 내역 확인하기</p>
                    </div>
                </div>
            </div>
            <div className="supportContainer">
                <div className="supportList">
                    <div className="supportText">
                        <p className="smallText">고객지원</p>
                        <p className="listText">이벤트</p>
                        <p className="listText">고객센터</p>
                        <p className="listText">문의하기</p>
                    </div>
                </div>
            </div>
            <MainFooter/>
        </div>
    );
}

export default Profile;